run/tutorials/case5_structure_rope/0/pE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    seaBed
    {
        type            fixedValue;
        value           uniform 0;
    }

    foundationSeabed
    {
        patchType       splitCyclic;
        type            fixedValue;
        value           uniform 0;
    }
    
    seabedFoundation
    {
        patchType       splitCyclic;
        type            fixedValue;
        value           uniform 0;
        //type            zeroGradient;
    }

    foundationTop
    {
        type            fixedValue;
        value           uniform 0;
    }

    "left|right"
    {
        type            splitCyclic;
    }

    soilDomainBottom
    {
        type            zeroGradient;
    }

    frontBack
    {
        type  		 empty;
    }
}

// ************************************************************************* //
