run/tutorials/case5_structure_rope/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/caseInfo"

application structureFoam;

startFrom startTime;

startTime $startTime;

stopAt endTime;

endTime $endTime;

deltaT $deltaT;

writeControl adjustableRunTime;

writeInterval $writeInterval;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression uncompressed;

timeFormat general;

timePrecision 6;

graphFormat raw;

runTimeModifiable yes;

libs ( "libliqueFvPatchFields.so" "libOpenFOAM.so" "libLiquefactionFvMeshFields.so" "libcontactModels.so"  "libsolidModels.so" );

#include "Functions.H"
